10/data/attachments/a9b6ed5b7a01c954.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Samantha_skill_Actions_46983_2</nif:username>
            <nif:friendToBeRequested>soap_actions_155782e0-0efb-4987-ac17-a2f2ef2aa06c</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>